message-board-api/app/models/message.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Isaac Newton"], ["created_at", "2018-08-19 20:34:14.095017"], ["updated_at", "2018-08-19 20:34:14.095017"]]
---
    def sender_attributes=(sender_attributes)
        sender = User.find_or_create_by(sender_attributes)

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "People"], ["created_at", "2018-08-19 20:34:14.366157"], ["updated_at", "2018-08-19 20:34:14.366157"]]
---
    def recipient_attributes=(recipient_attributes)
        recipient = User.find_or_create_by(recipient_attributes)