message-board-api/app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "sender_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "The simplification of anything is always sensational. "], ["sender_id", 39], ["created_at", "2018-08-19 21:16:24.111899"], ["updated_at", "2018-08-19 21:16:24.111899"]]
---
    def create
        message = Message.new(message_params)
        if message.save

DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 66]]
---
    def destroy
        if @message.destroy